/*Використовуючи оператори циклу, обчислити і вивести на екран у табличному вигляді
значення функції y=f(x) на заданому інтервалі зміни значень аргумента х від а до b з
кроком dx.
 За необхідності передбачити виникнення виключних ситуацій (невизначений
результат, ділення на нуль, корінь з від’ємного числа, логарифмування числа, меншого за нуль
тощо). 
Завдання варіанту 6: y=log2(x),  a=1, b=2, dx=0.025
Результати обчислень подати у вигляді наступної таблиці:*/

#include <stdio.h>
#include <math.h>

int main() {
    double a, b, dx;
    printf("Введіть початкове значення a: ");
    scanf("%lf", &a);

    printf("Введіть кінцеве значення b: ");
    scanf("%lf", &b);
    
    printf("Введіть крок dx: ");
    scanf("%lf", &dx);

    printf("x\t\t| y = log2(x)\n");
    printf("-----------------------\n");

    double x = a;
    while (x <= b) {
        double y;
        if (x <= 0) {
            printf("%lf\t| Невизначений результат\n", x);
        } else {
            y = log2(x);
            printf("%lf\t| %lf\n", x, y);
        }

        x += dx;
    }

    return 0;
}