//Обчислити середнє арифметичне всіх непарних чисел у діапозані [1;80]
//з параметром
#include <stdio.h>

int main() {
    int sum = 0;  // Змінна для суми непарних чисел
    int count = 0;  // Змінна для кількості непарних чисел
    int i;

    // Цикл з параметром, який обчислює суму та кількість непарних чисел
    for (i = 1; i <= 80; i += 2) {
        sum += i;
        count++;
    }

    double average = (double) sum / count;  // Обчислення середнього арифметичного
    printf("Середнє арифметичне непарних чисел: %.2lf\n", average);  // Виведення результату

    return 0;
}

